app/views/books/show.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."book_id" = ?  [["book_id", 9]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."book_id" = ?  [["book_id", 9]]
---
      <span class="number-of-reviews">
        <%= t('based-on', count: @book.reviews.count) %>