app/controllers/books_controller.rb

SELECT "categories".* FROM "categories"
SELECT "books".* FROM "books"
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "Fantasy"], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."category_id" = ? ORDER BY created_at DESC  [["category_id", 1]]
---
  def index
    if params[:category].blank?
      @book = Book.all
    else
      @category_id = Category.find_by(name: params[:category]).id
      @book = Book.where(:category_id => @category_id).order("created_at DESC")

SELECT "reviews".* FROM "reviews" WHERE "reviews"."book_id" = ?  [["book_id", 9]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."book_id" = ?  [["book_id", 1]]
SELECT AVG("reviews"."rating") FROM "reviews" WHERE "reviews"."book_id" = ?  [["book_id", 9]]
---
  def show
    if @book.reviews.blank?
      @average_review = 0
    else
      @average_review = @book.reviews.average(:rating).round(2)

SELECT "categories".* FROM "categories"
---
  def new
    @book = current_user.books.build
    @categories = Category.all.map{ |c| [c.name, c.id] }

INSERT INTO "books" ("title", "description", "author", "created_at", "updated_at", "user_id", "category_id", "book_img_file_name", "book_img_content_type", "book_img_file_size", "book_img_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @book = current_user.books.build(book_params)
    @book.category_id = params[:category_id]

    if @book.save

UPDATE "books" SET "book_img_file_name" = ?, "book_img_content_type" = ?, "book_img_file_size" = ?, "book_img_updated_at" = ?, "updated_at" = ? WHERE "books"."id" = ?
---
  def update
    @book.category_id = params[:category_id]
    if @book.update(book_params)