app/controllers/reviews_controller.rb

  def create
    @review = Review.new(review_params)
    @review.book_id = @book.id
    @review.user_id = current_user.id

    if @review.save
---
INSERT INTO "reviews" ("rating", "comment", "created_at", "updated_at", "user_id", "book_id") VALUES (?, ?, ?, ?, ?, ?)  [["rating", 5], ["comment", "hhgjghjhg"], ["created_at", "2018-05-04 21:00:14.884308"], ["updated_at", "2018-05-04 21:00:14.884308"], ["user_id", 1], ["book_id", 10]]

  def update
    if @review.update(review_params)
---
UPDATE "reviews" SET "rating" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["rating", 5], ["updated_at", "2018-05-04 20:00:48.731140"], ["id", 3]]

    def find_book
      @book = Book.find(params[:book_id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]

    def find_review
      @review = Review.find(params[:id])
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]